app/controllers/books_controller.rb

  def index
    @books = Book.all.each
---
SELECT "books".* FROM "books"

  def create
    @book = Book.new(book_params)
    if @book.save
---
INSERT INTO "books" ("title", "author", "genre", "price", "published_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @book = Book.find(params[:id])
    if @book.update_attributes(book_params)
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "title" = $1, "author" = $2, "genre" = $3, "price" = $4, "published_date" = $5, "updated_at" = $6 WHERE "books"."id" = $7  [["title", "Green Eggs and Ham"], ["author", "Dr. Suess"], ["genre", "Childrens"], ["price", 10.99], ["published_date", "2005"], ["updated_at", "2020-09-14 13:54:00.107973"], ["id", 1]]